app/controllers/nodes_controller.rb

INSERT INTO "nodes" ("deployment", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["deployment", "af"], ["status", "af"], ["created_at", "2019-09-25 10:19:54.321377"], ["updated_at", "2019-09-25 10:19:54.321377"]]
---
  def index
    test = ENV['CLIENT_EXEC']
    puts test
    listall = `bundle exec #{ENV['CLIENT_EXEC']} list --all`
    listall = listall.split("\n\n")
    @nodes = Array.new
    listall.each do |node|
      deployment = node.match(/Deployment: '(.*)'/)[1]
      status = node.match(/Status: (.*)/)[1]
      if status == "Offline" || deployment == "domain"
        power = "N/A"
      else
        power = `bundle exec #{ENV['CLIENT_EXEC']} power #{deployment} status`
        power = power.match(/#{deployment}: (.*)/)[1]
      end
      @nodes.push(
        Node.new(deployment,
                 status,
                 power
        )
      )